**Домашнее задание 2**

Во втором дз предлагается поработать с достаточно большим датасетом, [описание](https://archive.ics.uci.edu/ml/datasets/bank+marketing). Решите предложенные задания с использованием модуля Pandas (NumPy, разумеется, тоже разрешен).

Использование условий и циклов крайне нежелательно (списковые включения это тоже цикл!), за это будут снижаться баллы.
Все задания равноценны (кроме нулевой).
В каждой задаче постарайтесь придумать несколько решений. Решением должен быть Jupyter notebook / ссылка на Colab

In [66]:
import pandas as pd
import numpy as np
import math

In [14]:
url = 'https://raw.githubusercontent.com/Sketchjar/MachineLearningHD/main/bank_marketing_dataset.csv'

df = pd.read_csv(url)

0. Каков размер датасета? Выведите первые 2 строки. Выведите две случайные строки. Какие типы колонок в датафрейме?

In [28]:
df.size

864948

In [29]:
df.head(2)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,outcome
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,57,services,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no

In [30]:
df.sample(2)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,outcome
1763,24,services,single,high.school,no,yes,no,telephone,may,fri,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.855,5191.0,yes
23981,48,blue-collar,married,basic.4y,no,yes,no,cellular,aug,fri,...,6,999,0,nonexistent,1.4,93.444,-36.1,4.963,5228.1,no

In [31]:
df.dtypes

age                 int64
job                   str
marital               str
education             str
default               str
housing               str
loan                  str
contact               str
month                 str
day_of_week           str
duration            int64
campaign            int64
pdays               int64
previous            int64
poutcome              str
emp.var.rate      float64
cons.price.idx    float64
cons.conf.idx     float64
euribor3m         float64
nr.employed       float64
outcome               str
dtype: object

1. Выведите основные статистические показатели для числовых признаков – количество значений, среднее, стандартное отклонение, min/max, медиану, верхнюю и нижнюю квартиль.

In [26]:
df.describe()

,age,duration,campaign,pdays,previous,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed
count,41188.00000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000
mean,40.02406,258.285010,2.567593,962.475454,0.172963,0.081886,93.575664,-40.502600,3.621291,5167.035911
std,10.42125,259.279249,2.770014,186.910907,0.494901,1.570960,0.578840,4.628198,1.734447,72.251528
min,17.00000,0.000000,1.000000,0.000000,0.000000,-3.400000,92.201000,-50.800000,0.634000,4963.600000
25%,32.00000,102.000000,1.000000,999.000000,0.000000,-1.800000,93.075000,-42.700000,1.344000,5099.100000
50%,38.00000,180.000000,2.000000,999.000000,0.000000,1.100000,93.749000,-41.800000,4.857000,5191.000000
75%,47.00000,319.000000,3.000000,999.000000,0.000000,1.400000,93.994000,-36.400000,4.961000,5228.100000
max,98.00000,4918.000000,56.000000,999.000000,7.000000,1.400000,94.767000,-26.900000,5.045000,5228.100000

In [27]:
df.select_dtypes(include='number').agg([
    'count', 'mean', 'std', 'min', 'max', 'median', 
    lambda x: x.quantile(0.25), 
    lambda x: x.quantile(0.75)
])

,age,duration,campaign,pdays,previous,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed
count,41188.00000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000
mean,40.02406,258.285010,2.567593,962.475454,0.172963,0.081886,93.575664,-40.502600,3.621291,5167.035911
std,10.42125,259.279249,2.770014,186.910907,0.494901,1.570960,0.578840,4.628198,1.734447,72.251528
min,17.00000,0.000000,1.000000,0.000000,0.000000,-3.400000,92.201000,-50.800000,0.634000,4963.600000
max,98.00000,4918.000000,56.000000,999.000000,7.000000,1.400000,94.767000,-26.900000,5.045000,5228.100000
median,38.00000,180.000000,2.000000,999.000000,0.000000,1.100000,93.749000,-41.800000,4.857000,5191.000000
<lambda>,32.00000,102.000000,1.000000,999.000000,0.000000,-1.800000,93.075000,-42.700000,1.344000,5099.100000
<lambda>,47.00000,319.000000,3.000000,999.000000,0.000000,1.400000,93.994000,-36.400000,4.961000,5228.100000

2. Выведите число значений, уникальных значений, самое частое из значений (и его частоту) для всех остальных признаков.

In [34]:
df.describe(include=['object', 'string'])

,job,marital,education,default,housing,loan,contact,month,day_of_week,poutcome,outcome
count,41188,41188,41188,41188,41188,41188,41188,41188,41188,41188,41188
unique,12,4,8,3,3,3,2,10,5,3,2
top,admin.,married,university.degree,no,yes,no,cellular,may,thu,nonexistent,no
freq,10422,24928,12168,32588,21576,33950,26144,13769,8623,35563,36548

In [36]:
df.select_dtypes(exclude='number').describe()

,job,marital,education,default,housing,loan,contact,month,day_of_week,poutcome,outcome
count,41188,41188,41188,41188,41188,41188,41188,41188,41188,41188,41188
unique,12,4,8,3,3,3,2,10,5,3,2
top,admin.,married,university.degree,no,yes,no,cellular,may,thu,nonexistent,no
freq,10422,24928,12168,32588,21576,33950,26144,13769,8623,35563,36548

3. Сколько в выборке неграмотных людей? А безработных? Какой процент в выборке разведенных людей?

In [37]:
df['education'].unique()

<StringArray>
[           'basic.4y',         'high.school',            'basic.6y',
            'basic.9y', 'professional.course',             'unknown',
   'university.degree',          'illiterate']
Length: 8, dtype: str

In [46]:
(df['education'] == 'illiterate').sum()

np.int64(18)

In [47]:
(df['job'] == 'unemployed').sum()

np.int64(1014)

In [49]:
(df['marital'] == 'divorced').mean() * 100

np.float64(11.197436146450421)

In [50]:
df['education'].value_counts().get('illiterate', 0)

np.int64(18)

In [51]:
df['job'].value_counts().get('unemployed', 0)

np.int64(1014)

In [52]:
df['marital'].value_counts(normalize=True).get('divorced', 0) * 100

np.float64(11.197436146450421)

4. Вставьте вместо пропусков в колонку job самое частое значение в этой колонке

In [54]:
df['job'].fillna(df['job'].mode()[0])

0          housemaid
1           services
2           services
3             admin.
4           services
            ...
41183        retired
41184    blue-collar
41185        retired
41186     technician
41187        retired
Name: job, Length: 41188, dtype: str

In [55]:
df['job'].replace('unknown', df['job'].mode()[0])

0          housemaid
1           services
2           services
3             admin.
4           services
            ...
41183        retired
41184    blue-collar
41185        retired
41186     technician
41187        retired
Name: job, Length: 41188, dtype: str

5. Сравните средний возраст женатых и одиноких людей

In [58]:
df.groupby('marital')['age'].mean()['married']

np.float64(42.30716463414634)

In [59]:
df.groupby('marital')['age'].mean()['single']

np.float64(33.15871369294606)

In [62]:
df[df['marital'].isin(['married', 'single'])].pivot_table(
    values='age', 
    index='marital', 
    aggfunc='mean'
)

               age
marital
married  42.307165
single   33.158714

6. Добавьте в датафрейм признак "логарифм длины последнего звонка". Для некоторых моделей машинного обучения могут быть полезны подобные признаки.

In [67]:
df['log_duration'] = np.log(df['duration'])

In [69]:
df['log_duration'] = np.log1p(df['duration'])

7. Выведите часть датасета, в которой будут все люди с минимальным в выборке возрастом, согласившиеся на срочный вклад

In [71]:
min_age = df['age'].min()
df[(df['outcome'] == 'yes') & (df['age'] == min_age)]

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,outcome,log_duration
37579,17,student,single,basic.9y,no,unknown,unknown,cellular,aug,fri,...,999,1,failure,-2.9,92.201,-31.4,0.869,5076.2,yes,6.212606
38274,17,student,single,unknown,no,no,yes,cellular,oct,tue,...,2,2,success,-3.4,92.431,-26.9,0.742,5017.5,yes,6.799056

In [72]:
df.query("outcome == 'yes' and age == @min_age")

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,outcome,log_duration
37579,17,student,single,basic.9y,no,unknown,unknown,cellular,aug,fri,...,999,1,failure,-2.9,92.201,-31.4,0.869,5076.2,yes,6.212606
38274,17,student,single,unknown,no,no,yes,cellular,oct,tue,...,2,2,success,-3.4,92.431,-26.9,0.742,5017.5,yes,6.799056

8. Создайте новый датафрейм, в который войдут 10 самых возрастных клиентов, которые работают. В нем строки должны быть отсортированы по возрасту в порядке убывания, а индексом должны являться числа от 0 до 9 включительно. Оставьте в новом датафрейме (помимо индекса) только колонки age, marital education, housing, loan

In [75]:
df[(df['job'] != 'unemployed') & (df['job'] != 'unknown')].sort_values(by='age', ascending=False).head(10)[['age', 'marital', 'education', 'housing', 'loan']].reset_index(drop=True)

   age   marital          education housing loan
0   98   married           basic.4y     yes   no
1   98   married           basic.4y     yes   no
2   95  divorced           basic.6y      no   no
3   94   married           basic.9y      no   no
4   92   married            unknown      no  yes
5   92  divorced            unknown      no   no
6   92   married            unknown     yes   no
7   92   married            unknown      no  yes
8   91   married  university.degree      no  yes
9   91   married  university.degree     yes  yes

In [76]:
df[(df['job'] != 'unemployed') & (df['job'] != 'unknown')].nlargest(10, 'age')[['age', 'marital', 'education', 'housing', 'loan']].reset_index(drop=True)

   age   marital          education housing loan
0   98   married           basic.4y     yes   no
1   98   married           basic.4y     yes   no
2   95  divorced           basic.6y      no   no
3   94   married           basic.9y      no   no
4   92   married            unknown     yes   no
5   92  divorced            unknown      no   no
6   92   married            unknown      no  yes
7   92   married            unknown      no  yes
8   91   married  university.degree     yes  yes
9   91   married  university.degree      no  yes

9. Создайте столбец с датой контакта. Дата должна соответствовать информации из столбцов month и day_of_week и относиться к 2021 году (в этом задании может быть, разумеется, много верных ответов, выведите любой)

In [77]:
df['contact_date'] = pd.to_datetime(
    '2021-' + df['month'] + '-01',
    format='%Y-%b-%d'
)

In [88]:
day_map = {'mon': 0, 'tue': 1, 'wed': 2, 'thu': 3, 'fri': 4}
first = pd.to_datetime('2021-' + df['month'], format='%Y-%b')
df['contact_date'] = first + pd.to_timedelta(
    (df['day_of_week'].map(day_map) - first.dt.dayofweek) % 7, unit='D'
)

In [89]:
df.describe()

,age,duration,campaign,pdays,previous,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,log_duration,contact_date
count,41188.00000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188
mean,40.02406,258.285010,2.567593,962.475454,0.172963,0.081886,93.575664,-40.502600,3.621291,5167.035911,5.173036,2021-06-22 12:29:34.652811
min,17.00000,0.000000,1.000000,0.000000,0.000000,-3.400000,92.201000,-50.800000,0.634000,4963.600000,0.000000,2021-03-01 00:00:00
25%,32.00000,102.000000,1.000000,999.000000,0.000000,-1.800000,93.075000,-42.700000,1.344000,5099.100000,4.634729,2021-05-05 00:00:00
50%,38.00000,180.000000,2.000000,999.000000,0.000000,1.100000,93.749000,-41.800000,4.857000,5191.000000,5.198497,2021-06-04 00:00:00
75%,47.00000,319.000000,3.000000,999.000000,0.000000,1.400000,93.994000,-36.400000,4.961000,5228.100000,5.768321,2021-08-03 00:00:00
max,98.00000,4918.000000,56.000000,999.000000,7.000000,1.400000,94.767000,-26.900000,5.045000,5228.100000,8.500861,2021-12-07 00:00:00
std,10.42125,259.279249,2.770014,186.910907,0.494901,1.570960,0.578840,4.628198,1.734447,72.251528,0.916938,NaN

10. Какие два столбца исходного датафрейма наиболее скоррелированные?

In [87]:
corr = df.corr(numeric_only=True).abs()
corr.where(~np.eye(len(corr), dtype=bool)).stack().idxmax()

('emp.var.rate', 'euribor3m')